In [85]:
import pandas as pd
import numpy as np

#create a dictionary array
dictData = {
    'subjects':['english','swahili','chem','physics','maths'],
    'pass':[12,13,34,23,1],
    'fails':[1,3,1,4,7]
}

#add labels for index
labels = [1,2,3,4,5]
df = pd.DataFrame(dictData,index=labels)
print(df)

  subjects  pass  fails
1  english    12      1
2  swahili    13      3
3     chem    34      1
4  physics    23      4
5    maths     1      7

In [86]:
#Describing to have a general overview
df.describe()

            pass    fails
count   5.000000  5.00000
mean   16.600000  3.20000
std    12.461942  2.48998
min     1.000000  1.00000
25%    12.000000  1.00000
50%    13.000000  3.00000
75%    23.000000  4.00000
max    34.000000  7.00000

In [87]:
#Transposing
df.T

                1        2     3        4      5
subjects  english  swahili  chem  physics  maths
pass           12       13    34       23      1
fails           1        3     1        4      7

In [88]:
#Sorting data using no of pass
df.sort_values(by='pass')

  subjects  pass  fails
5    maths     1      7
1  english    12      1
2  swahili    13      3
4  physics    23      4
3     chem    34      1

In [89]:
#Slicing by getting first 2
df[:2]

  subjects  pass  fails
1  english    12      1
2  swahili    13      3

In [90]:
#Getting top 2 by no of fails
df.sort_values(by='fails')[:2]

  subjects  pass  fails
1  english    12      1
3     chem    34      1

In [91]:
#Getting pass only
df[['fails']]

   fails
1      1
2      3
3      1
4      4
5      7

In [92]:
#Checking if there are any null values
df.isnull()

   subjects   pass  fails
1     False  False  False
2     False  False  False
3     False  False  False
4     False  False  False
5     False  False  False

In [93]:
#finding means
print(df.mean())
print(df[['pass']].mean())
print(df[['fails']].mean())

pass     16.6
fails     3.2
dtype: float64
pass    16.6
dtype: float64
fails    3.2
dtype: float64

In [82]:
#Finding sum
print(df.sum())

subjects    englishswahilichemphysicsmaths
pass                                    83
fails                                   16
dtype: object

In [95]:
#working with missing values
df2 = [1,2,3,np.nan,4,5]
df2 = pd.DataFrame(df2)
df1 = df2.copy()
print(df2)

     0
0  1.0
1  2.0
2  3.0
3  NaN
4  4.0
5  5.0

In [97]:
#replace the null values with zero
df2 = df2.fillna(0)
print(df2)

     0
0  1.0
1  2.0
2  3.0
3  0.0
4  4.0
5  5.0

In [99]:
#DRopping all null rows
df1 = df1.dropna(how='any')
print(df1)

     0
0  1.0
1  2.0
2  3.0
4  4.0
5  5.0

In [103]:
#saving and reading data using files
df1.to_csv('data.csv')
df1.to_excel('data.xlsx',sheet_name='sheet1')
df_readData=pd.read_csv('data.csv')

In [101]:
df_readData.head(5)

   Unnamed: 0    0
0           0  1.0
1           1  2.0
2           2  3.0
3           4  4.0
4           5  5.0